docs/corners/david/lowlevel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-31 Sun 12:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Low-Level Programming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Low-Level Programming</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-10-31 Sun 12:33</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='data-oriented.html'>Data-Oriented Design and C++</a></li> <li><a class='backlink' href='compilers.html'>Compilers</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org32c2dff">1. Low Level Programming</a></li>
<li><a href="#org099277b">2. Basic Computer Architecture</a>
<ul>
<li><a href="#org8f81afc">2.1. Core Architecture</a></li>
<li><a href="#orgd020f72">2.2. Evolution</a></li>
<li><a href="#org73e20a7">2.3. Registers</a></li>
<li><a href="#org8a2794e">2.4. Protection Rings</a></li>
<li><a href="#org94e5829">2.5. Hardware Stack</a></li>
<li><a href="#org783c6f7">2.6. Summary</a></li>
</ul>
</li>
<li><a href="#orge174006">3. Assembly Language</a></li>
<li><a href="#org79148f6">4. Legacy Modes</a></li>
<li><a href="#org6715eed">5. Virtual Memory</a></li>
<li><a href="#org66de541">6. Compilation Pipeline</a></li>
<li><a href="#org2d94209">7. Interrupts and System Calls</a></li>
<li><a href="#orgddf2363">8. Models of Computation</a></li>
</ul>
</div></div>
</div>

<div id="outline-container-org32c2dff" class="outline-2">
<h2 id="org32c2dff"><span class="section-number-2">1</span> Low Level Programming</h2>
</div>


<div id="outline-container-org099277b" class="outline-2">
<h2 id="org099277b"><span class="section-number-2">2</span> Basic Computer Architecture</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8f81afc" class="outline-3">
<h3 id="org8f81afc"><span class="section-number-3">2.1</span> Core Architecture</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Before computers existed, research was put into designing methods of automating calculations: notable examples being Lambda calculus, the Turing machine, and the von Neumann architecture. The von Neumann architecture won out due to its ease of programmability and robustness.
</p>

<p>
It consists of a CPU connected to a memory bank, where a Arithmetic Logic Unit (ALU) in the CPU performs calculations and a control unit fetches things from memory.
</p>

<p>
Programs are a series of instructions fetched sequentially (except when JMP instructions are involved). Assembly language is a human-readable version (or mnemonics) for the binary instruction.
</p>
</div>
</div>

<div id="outline-container-orgd020f72" class="outline-3">
<h3 id="orgd020f72"><span class="section-number-3">2.2</span> Evolution</h3>
<div class="outline-text-3" id="text-2-2">
<p>
There are some problems with the above design model:
</p>
<ul class="org-ul">
<li>Manual memory editing is required for interacting with computer</li>
<li>Multitasking is impossible so computer is just stuck for periods of time</li>
<li>No protection for instructions so user applications can wreak havoc</li>
<li>Hardware bottlenecks become a problem when people start building parts separately</li>
</ul>

<p>
The Intel 64 architecture addresses these problems with extensions to von Neumann architecture.
</p>
<ul class="org-ul">
<li>Registers, or tiny pieces of memory located on the CPU die itself</li>
<li>The hardware stack, for storing local variables and implementing scope/functions</li>
<li>Interrupts, which can affect/suspend/stop program execution from outside the program. Examples of when interrupts would be called are things like zero division, invalid instructions, etc.</li>
<li>Protection rings, which restrict certain instructions based on what "ring" you are in</li>
<li>Virtual memory, which allows memory to be distributed across programs?</li>
</ul>
</div>
</div>

<div id="outline-container-org73e20a7" class="outline-3">
<h3 id="org73e20a7"><span class="section-number-3">2.3</span> Registers</h3>
</div>
<div id="outline-container-org8a2794e" class="outline-3">
<h3 id="org8a2794e"><span class="section-number-3">2.4</span> Protection Rings</h3>
</div>
<div id="outline-container-org94e5829" class="outline-3">
<h3 id="org94e5829"><span class="section-number-3">2.5</span> Hardware Stack</h3>
</div>
<div id="outline-container-org783c6f7" class="outline-3">
<h3 id="org783c6f7"><span class="section-number-3">2.6</span> Summary</h3>
</div>
</div>

<div id="outline-container-orge174006" class="outline-2">
<h2 id="orge174006"><span class="section-number-2">3</span> Assembly Language</h2>
</div>

<div id="outline-container-org79148f6" class="outline-2">
<h2 id="org79148f6"><span class="section-number-2">4</span> Legacy Modes</h2>
</div>

<div id="outline-container-org6715eed" class="outline-2">
<h2 id="org6715eed"><span class="section-number-2">5</span> Virtual Memory</h2>
</div>

<div id="outline-container-org66de541" class="outline-2">
<h2 id="org66de541"><span class="section-number-2">6</span> Compilation Pipeline</h2>
</div>

<div id="outline-container-org2d94209" class="outline-2">
<h2 id="org2d94209"><span class="section-number-2">7</span> Interrupts and System Calls</h2>
</div>

<div id="outline-container-orgddf2363" class="outline-2">
<h2 id="orgddf2363"><span class="section-number-2">8</span> Models of Computation</h2>
<div class="outline-text-2" id="text-8">
</div>
</div>
</div>
</body>
</html>
